/*-----------------------------------------------------------------------------------------
Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
-----------------------------------------------------------------------------------------*/

long Akkerman(long m, long n)
{
    if( m > 0 )
        if( n > 0)
            return Akkerman(m-1, Akkerman(m, n-1));
        else
            return Akkerman(m-1, 1);
    else
        return n+1;
}

Console.WriteLine(Akkerman(3,2));