/*------------------------------------------------------------------------------------------------------------------
Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
------------------------------------------------------------------------------------------------------------------*/

void ShowNums(int m, int n)
{
    if(m!=n)
        if(m<n)
        {
            Console.Write(m+" ");
            ShowNums(m+1,n);
        }
        else
        {
            ShowNums(m-1,n);
            Console.Write(m+" ");
        }
}


ShowNums(15,3);