/*-----------------------------------------------------------------------------------------
Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
-----------------------------------------------------------------------------------------*/
int SumNums(int m, int n)
{
    if(m!=n)
        if(m<n)
            return SumNums(m+1,n)+m;
        else
            return SumNums(m-1,n)+m;
    else return m;
}


Console.WriteLine(SumNums(5, 3));